# Pandas 1
Â© Advanced Analytics, Amir Ben Haim, 2024

Pandas is a library specialized in data manipulation, transformasion and saving data.

<br>
<br>
<hr class="dotted">
<br>
<br>

## Creating <code>df</code>

One of the main functions of pandas are the dataframes. Dataframes are tables on which the columns are the variables and the rows are the observations.
- The columns can contain any data type
- All the columns must have the same numer of rows
- We can create datasets by passing a dictionary to the dataframe function

In [2]:
### First we have to import the pandas
import pandas as pd

In [3]:
# Reminder for dictionary
d = {
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi','barbara','chen','debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    }

d

{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
 'name': ['Avi',
  'Betti',
  'Clair',
  'Doron',
  'Eli',
  'abi',
  'barbara',
  'chen',
  'debra',
  'eylin'],
 'age': [25, 40, 30.5, 25, 32, 40, 50, 46.5, 27, 35],
 'student': [True, False, False, True, False, True, False, True, False, False]}

In [4]:
type(d)

dict

In [5]:
d.keys()

dict_keys(['id', 'name', 'age', 'student'])

In [6]:
d.values()

dict_values([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], ['Avi', 'Betti', 'Clair', 'Doron', 'Eli', 'abi', 'barbara', 'chen', 'debra', 'eylin'], [25, 40, 30.5, 25, 32, 40, 50, 46.5, 27, 35], [True, False, False, True, False, True, False, True, False, False]])

In [7]:
# Creating a DataFrame
df = pd.DataFrame(d)
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [8]:
d2 = {
      'id':[1,2,3,4,5,6,7,8,9,10],
      'name':['Avi','Betti'],                 # Only 2 values
      'age':[25,40,30.5,25,32,40,50,46.5,27,35],
      'student':[True,False,False,True,False,True,False,True,False,False]
    }

d2

{'id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
 'name': ['Avi', 'Betti'],
 'age': [25, 40, 30.5, 25, 32, 40, 50, 46.5, 27, 35],
 'student': [True, False, False, True, False, True, False, True, False, False]}

In [9]:
type(d2)

dict

In [10]:
# ERROR
# arrays must all be same length
df_Error = pd.DataFrame(d2)


df_Error

ValueError: All arrays must be of the same length

In [ ]:
# Can we have different data types in the same column ??!
# Well, not exactly. it looks like it works but basiclly we get colums with datatype "object"
df_Not_Exactly_An_Error = pd.DataFrame({
      'id':[1,2,3,4,5,6,7,'8','9',10],
      'name':['Avi','Betti','Clair','Doron','Eli','abi',86,77,'debra','eylin'],
      'age':[25,40,30.5,25,32,40,50,'46.5','27',35],
      'student':[True,False,False,True,False,True,False,True,4,6]

    })

df_Not_Exactly_An_Error


# dtype "object" in python can hold any python object, not only "strings". It can hold "list", "dict" and so on...
# In Pandas columns with mixed types or strings are stored with "object" dtype.

# Can be problematic way to work, we bettr avoid that !!!

In [ ]:
# What are the data types
df_Not_Exactly_An_Error.dtypes

In [11]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [12]:
# what are the columns data types for the NORMAL df ?
df.dtypes

id           int64
name        object
age        float64
student       bool
dtype: object

<br>
<p style = "font-size:25px">Let's check the difference between the two DataFrames</p>

In [13]:
# For example, let's try to use the function 'mean' to the values in 'age'
# ERROR
df_Not_Exactly_An_Error["age"].mean()
# Look at the error we recieved: "unsupported operand type(s) for +: 'int' and 'str"

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [14]:
# Works greate!
df["age"].mean()

np.float64(35.1)

In [15]:
# Same thing goes for 'id', let's try to sum the numbers, just for the example
# ERROR
df_Not_Exactly_An_Error["id"].sum()
# Look at the error we recieved: "unsupported operand type(s) for +: 'int' and 'str'"

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [16]:
# Works greate!
df["id"].sum()

np.int64(55)

In [17]:
# Same thing goes for 'name', let's try to sum the values, just for the example
# ERROR
df_Not_Exactly_An_Error["name"].sum()
# Look at the error we recieved: "can only concatenate str (not "int") to str"

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [18]:
# Works greate!
df["name"].sum()

'AviBettiClairDoronEliabibarbarachendebraeylin'

In [19]:
# 'student' column works, but Why ??
df_Not_Exactly_An_Error["student"].sum()
# Because he considers "True" = 1, and "False" = 0

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [20]:
df_Not_Exactly_An_Error

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [21]:
# Works greate!
df["student"].sum()

np.int64(4)

In [22]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [23]:
# How can we fix the problem for all the columns
# We'll convert the columns datatypes
df_Not_Exactly_An_Error["id"] = df_Not_Exactly_An_Error["id"].astype(int)
df_Not_Exactly_An_Error["name"] = df_Not_Exactly_An_Error["name"].astype(str)
df_Not_Exactly_An_Error["age"] = df_Not_Exactly_An_Error["age"].astype(float)

df_Not_Exactly_An_Error["student"] = df_Not_Exactly_An_Error["student"].astype(bool)


df_Not_Exactly_An_Error.dtypes

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [24]:
df_Not_Exactly_An_Error

NameError: name 'df_Not_Exactly_An_Error' is not defined

In [25]:
# No more problems!
df_Not_Exactly_An_Error.sum()

NameError: name 'df_Not_Exactly_An_Error' is not defined

<br>
<p style = "font-size:25px">Important Conclusion !!!</p>

- All columns must all be the same length
- In Pandas columns with 'mixed types' or 'strings' are stored with "object" dtype. we better avoid that, and we'll force the colums to be as the same type with method "astype()"</p>

<br>
<br>
<hr class="dotted">
<br>
<br>

## A few common <code>df</code> methods

In [26]:
#Back to our df
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [27]:
df.head()

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True
4   5    Eli  32.0    False

In [28]:
df.head(2)

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False

In [29]:
df.tail()

   id     name   age  student
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [17]:
df.tail(2)

   id   name   age  student
8   9  debra  27.0    False
9  10  eylin  35.0    False

In [30]:
df.describe()

             id       age
count  10.00000  10.00000
mean    5.50000  35.10000
std     3.02765   8.82169
min     1.00000  25.00000
25%     3.25000  27.87500
50%     5.50000  33.50000
75%     7.75000  40.00000
max    10.00000  50.00000

In [31]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [32]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   id       10 non-null     int64
 1   name     10 non-null     object
 2   age      10 non-null     float64
 3   student  10 non-null     bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 382.0+ bytes

In [33]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [34]:
# when sorting lower letters have higher value than upper letters
df.sort_values(ascending=False,by='name')

   id     name   age  student
9  10    eylin  35.0    False
8   9    debra  27.0    False
7   8     chen  46.5     True
6   7  barbara  50.0    False
5   6      abi  40.0     True
4   5      Eli  32.0    False
3   4    Doron  25.0     True
2   3    Clair  30.5    False
1   2    Betti  40.0    False
0   1      Avi  25.0     True

In [35]:
df.sort_values(ascending=True,by='name')

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [36]:
df.sort_values(ascending=False,by='id')

   id     name   age  student
9  10    eylin  35.0    False
8   9    debra  27.0    False
7   8     chen  46.5     True
6   7  barbara  50.0    False
5   6      abi  40.0     True
4   5      Eli  32.0    False
3   4    Doron  25.0     True
2   3    Clair  30.5    False
1   2    Betti  40.0    False
0   1      Avi  25.0     True

In [37]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [38]:
df.to_numpy()

array([[1, 'Avi', 25.0, True],
       [2, 'Betti', 40.0, False],
       [3, 'Clair', 30.5, False],
       [4, 'Doron', 25.0, True],
       [5, 'Eli', 32.0, False],
       [6, 'abi', 40.0, True],
       [7, 'barbara', 50.0, False],
       [8, 'chen', 46.5, True],
       [9, 'debra', 27.0, False],
       [10, 'eylin', 35.0, False]], dtype=object)

In [39]:
df[['id','age','student']].mean()

id          5.5
age        35.1
student     0.4
dtype: float64

In [ ]:
df[['id','age','student']].median()

In [ ]:
df[['id','age','student']].sum()

In [ ]:
df[['id','age','student']].count()

In [ ]:
# Counts the occurrences for each unique value
df['student'].value_counts()

<br>
<br>
<hr class="dotted">
<br>
<br>

## A few common <code>df</code> attributes

In [ ]:
df.dtypes

In [ ]:
list(df.columns)

In [ ]:
df.values

<br>
<br>
<hr class="dotted">
<br>
<br>

## Selecting & Slicing & Filtering - Index Operstor <code>[]</code>

### Selecting Columns

#### Possible: One column or specific columns

In [40]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [41]:
# one column
df['id']
# returned Data Type = Series
# If we select a single COLUMN from a DataFrame we get a Series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: id, dtype: int64

In [ ]:
# one column
df['name']
# returned Data Type = Series
# If we select a single COLUMN from a DataFrame we get a Series

In [ ]:
# two specific columns
# Notice the extra []
df[['id','name']]
# returned Data Type = DataFrame
# If we select a MULTIPLE COLUMNS from a DataFrame we get a Dataframe

In [ ]:
# two specific columns
# Notice the extra []
df[['id','age']]
# returned Data Type = DataFrame
# If we select a MULTIPLE COLUMNS from a DataFrame we get a Dataframe

In [ ]:
# three specific columns
# Notice the extra []
df[['id','age','name']]
# returned Data Type = DataFrame

#### Not Possible: columns Range

In [ ]:
# Error
# columns range - not possible with the index operator
df['id':'age']

### Slicing rows (with indexes)
Slicing rows (= by index)

#### Possible: rows Range

In [42]:
# Row range
df[0:4]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
0   1    Avi  25.0     True
1   2  Betti  40.0    False
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [43]:
# Row range
df[2:4]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
2   3  Clair  30.5    False
3   4  Doron  25.0     True

In [44]:
df

   id     name   age  student
0   1      Avi  25.0     True
1   2    Betti  40.0    False
2   3    Clair  30.5    False
3   4    Doron  25.0     True
4   5      Eli  32.0    False
5   6      abi  40.0     True
6   7  barbara  50.0    False
7   8     chen  46.5     True
8   9    debra  27.0    False
9  10    eylin  35.0    False

In [45]:
# Row range
df[-3:-1]
# returned Data Type = DataFrame
# If we select a MULTIPLE ROWS from a DataFrame we get a DF

   id   name   age  student
7   8   chen  46.5     True
8   9  debra  27.0    False

In [47]:
df.loc[2]

id             3
name       Clair
age         30.5
student    False
Name: 2, dtype: object

In [ ]:
# Row range
df[0:1]
# returned Data Type = DataFrame --- Even when we got only one row!!

In [ ]:
# Row range
df[2:3]
# returned Data Type = DataFrame --- Even when we got only one row!!

In [ ]:
# Row range with step
df[0:4:2]
# returned Data Type = DataFrame

In [ ]:
# Row range with step
df[::-1]
# returned Data Type = DataFrame

In [ ]:
# Row range with step - the step didn't really matter
df[0:4:1]
# returned Data Type = DataFrame

In [ ]:
# Row range
df[4:0]
# returned Data Type =   E M P T Y   DataFrame, because you can't start from index row 4 and finish at 0

In [ ]:
# Row range
df[4:0:-1]
# returned Data Type =  N O T   A N   E M P T Y   DataFrame, because the step change the range direction, we started from index 4 and then went backwards (also notice we didn't get index 0)

#### Not Possible: One Row or specific Rows

In [ ]:
# Error
# Specific Row - not possible with the index operator
df[[0,2]]

In [ ]:
# Error
# Specific Row - not possible with the index operator
df[0,2]

In [ ]:
# Error
# Specific Row - not possible with the index operator
df[2]

### Filtering (Subset) rows (by condition)

filtering rows (= by Conditions)

 Comparison Operatoes
- <code>==</code>
- <code>!=</code>
- <code><=</code>
- <code><</code>
- <code>>=</code>
- <code>></code>

Logical Operatoes
<br>
 - `|` for 'or'
 - `&` for 'and'
 - `~` for 'not'

#### Possible: One Condition

In [ ]:
df

In [ ]:
# Filtering Rows by One condition
df[df['age'] > 30]

In [ ]:
#   B R E A K D O W N   -   Filtering Rows by One condition
df['age']

In [ ]:
#   B R E A K D O W N   -   Filtering Rows by One condition
df['age'] > 30

In [ ]:
df[      df['age'] > 30     ]

In [ ]:
df['id'] == 3

In [ ]:
# Filtering Rows by One condition
df[   df['id'] == 3   ]

In [ ]:
# Filtering Rows by One condition
df[   df['student'] != True   ]

In [ ]:
df[df['age'] >= 40]

#### Possible: Multiple Conditions

In [ ]:
df

In [ ]:
(df['age'] > 30)   &   (df['student'] == True)

In [ ]:
# Filtering Rows by Multiple conditions
# and
df[   (df['age'] > 30)   &   (df['student'] == True)   ]

In [ ]:
# Filtering Rows by Multiple conditions
# or
df[   (df['age'] > 30)   |   (df['student'] == True)   ]

In [ ]:
# Filtering Rows by Multiple conditions
# and + or
df[   (df['age'] > 45) |   ((df['student'] == True) & (df['id'] > 5))   ]

In [ ]:
df

In [ ]:
df['age'].isin([40,50,30.5])

In [ ]:


# Using a method 'isin()'
df[   df['age'].isin([40,50,30.5])   ]

In [ ]:
# Not '~'
# Using a method 'isin()'
df[   ~   df['age'].isin([40,50,30.5])   ]

#### Possible: isnull Condition

<br>
<p style = "font-size:25px">Inserting a new row with <code>Null</code> values</p>

In [ ]:
df

In [ ]:
df.loc[10] = [11,'ben',None,True]
df

In [ ]:
df['age'].isnull()

In [ ]:
# filtering 'Null' rows in column 'age'
df[df['age'].isnull()]

In [ ]:
# Same thing as 'isnull()'
df[df['age'].isna()]

In [ ]:
# with ~
df[    ~ df['age'].isna()   ]

In [ ]:
# filtering 'Null' rows in column 'age'
df[df['age'].notnull()]

In [ ]:
# Same thing as 'notnull()'
df[df['age'].notna()]

<br>
<br>
<hr class="dotted">
<br>
<br>

## <code>.loc[]</code> and <code>.iloc[]</code>

- [] = Specific rows/column
- : = Range for rows/column

In [ ]:
# Error
# index operator not possible to control both rows and columns
df[0:4, 'name']

In [ ]:
# Error
# index operator not possible to control both rows and columns
df[df['student'] != True, 'name']

### <code>.loc[]</code>

To select specific rows and specific columns we use the function <code>loc</code>

In [ ]:
## slicing rows ranging from 2 to 4 and selecting specific columns ('name' and 'student')
df.loc[   2:4  ,   ['name','student']  ]

# Notice, when using 'loc[]' we also get row with index 4

In [ ]:
## slicing rows ranging from 2 to 4 and selecting range columns ('name' to 'student')
df.loc[2:4   ,   'name':'student']

# Notice, when using 'loc[]' we also get row with index 4

In [ ]:
# We can do the same with rows
## slicing specific rows 2 and 4 and selecting range columns ('name' to 'student')
df.loc[   [2,4],      'name':'student']

In [ ]:
df.loc[4]

### <code>.iloc[]</code>
We can also use <code>iloc[]</code> to select specific rows and specific columns we use the function 'loc'

In [ ]:
## slicing rows ranging from 2 to 3 and selecting range columns (all columns)
df.iloc[2:4,:]

# Why ??! didn't we get row number 4. just like we got before when using loc ??!
# Notice, when using 'iloc[]' we didn't get row with index 4

In [ ]:
## slicing rows ranging from 2 to 3 and selecting specific columns ('id','age')
df.iloc[2:4,[0,2]]
# Notice, when using 'iloc[]' we didn't get row with index 4

In [ ]:
## slicing specific rows 2 and 4 and selecting range columns
df.iloc[[2,4],0:3]

# Notice, when using 'iloc[]' we didn't get column with index 3

In [ ]:
# ERROR
## we can't use columns name with 'iloc[]'
df.iloc[[2,4],'id':'age']

### <code>.at[]</code>

In [ ]:
# to retrieve the content of a specific cell we use the function 'at'
df.at[4,"name"]

In [ ]:
## An alternative way of obtaining a cell are
df.loc[4,"name"]

### Filtering with <code>.loc[]</code>

In [ ]:
# Filtering with 'loc[]'
df.loc[ df["id"]>3 ,'id':'age']

<p style = "font-size:25px"> So, what is the difference between loc and iloc ?</p>
- loc = is <b><u>label-based</u></b>, which means that you have to specify rows and columns based on their row and column labels<br>
- iloc = is integer <b><u>position-based</u></b>, so you have to specify rows and columns by their integer position values (0-based integer position)
<br>
<br>

### <code>.loc[]</code> and <code>.iloc[]</code> last example

In [ ]:
# Creating the same df, but this time with custom indexes --> not the default one!
# now the Indexes are 'a','b','c',....etc
# before they were '0','1','2',....

d2 = {
      'id':[1,2,3,4,5],
      'name':['Avi','Betti','Clair','Doron','Eli'],
      'age':[25,40,30.5,25,32],
      'student':[True,False,False,True,False]
    }

labels = ['a', 'b', 'c', 'd', 'e']

df2= pd.DataFrame(d2, index=labels)
df2

In [ ]:
# Error
df2.loc[1:4]

In [ ]:
df2.loc['b':'e']

In [ ]:
df2

In [ ]:
df2.iloc[1:4]

In [ ]:
df

In [ ]:
df.loc[1:4]

In [ ]:
df

In [ ]:
df.loc[: , 'name':'student']

In [ ]:
df2

In [ ]:
df2.loc[:, 'name':'student']

In [ ]:
df

In [ ]:
#Error
df.iloc[: , 'name':'student']

In [ ]:
df2.iloc[:, 1:4]

In [ ]:
# "iloc" refers only to the INDEX and can work both on rows and coloms
# The comma in the square brackets:
    # The parameters to the left of the comma always selects rows based on the row index
    # The parameters to the right of the comma always selects columns based on the column index

# Here we only refered to the rows, we asked for all of the rows, and also got all the column (when we dont specify the column --> we get all of them)
df2.iloc[:]

In [ ]:
# All rows, the 2 first columns --> Range (':')
df2.iloc[:,0:2]

In [ ]:
# 2 first rows, the 2 first columns --> Range (':')
df2.iloc[0:2,0:2]

In [ ]:
# 2 specific rows, 2 specific (',') columns --> Not Range
df2.iloc[[0,3],[0,2]]
# We've passed a list to the index operator --> not a RANGE as we did before !!!

In [ ]:
# "loc" refers only to the VALUES  and can work both on rows and coloms
# The comma in the square brackets:
    # The parameters to the left of the comma always selects rows based on the row value
    # The parameters to the right of the comma always selects columns based on the column value

# Here we only refered to the rows, we asked for all of the rows, and also got all the column (when we dont specify the column --> we get all of them)
df2.loc[:]

In [ ]:
# If we we will try to use "loc" and reffer to an index we will get an
# ERROR
df2.loc[0]

In [ ]:
# If we we will use "loc" and reffer to a value we'll get the correct outcome
df2.loc['a']

In [ ]:
# All rows, the 2 first columns --> Range (':')
df2.loc[:,'id':'name']

In [ ]:
# 2 first rows, the 2 first columns --> Range (':')
df2.loc['a':'c','id':'name']

In [ ]:
# 2 specific rows (','), 2 specific (',') columns --> Not Range
df2.loc[['a','c'],['id','age']]
# We've passed a list --> not a RANGE as we did before !!!

<br>
<br>
<hr class="dotted">
<br>
<br>

### When exactly do we get a `DataFrame` and when a `Series`

In [ ]:
df

#### Columns

- One Column --> `Series`
- Two Column (or more) --> `df`

In [ ]:
# One Column --> Series
df['name']

In [ ]:
# Two Column (or more) --> df
df[['name','age']]

#### Rows

Notice the different behavior (the `type` that returns) <u>FOR THE SAME ONE ROW !</u>

In [ ]:
# Rturned type = df
df[2:3]

In [ ]:
# Rturned type = df
df[df['id']==3]

In [ ]:
# Rturned type = Series
df.loc[2]

In [ ]:
# Rturned type = df
df.loc[df['id']==3]

In [ ]:
# Rturned type = df
df.iloc[2:3]

In [ ]:
# Rturned type = Series
df.iloc[2]

<br>

<u>Why is that ??</u>
<br>
well, it depends on how we used the index operator
<br>
- When we use it to slice <u>WITH RANGE</u> --> Returned Type = `df` --> <u>(EVEN IF THE OUTCOME IS ONLY ONE ROW)</u>



- When we use it to filter <u>WITH A BOOLEAN SERIES</u> --> Returned Type = `df` --> <u>(EVEN IF THE OUTCOME IS ONLY ONE ROW)</u>


- When we use it to slice (again), but this time with <u>ONLY ONE VALUE</u> --> Returned Type = `series`

<br>
<br>
<hr class="dotted">
<br>
<br>

## dot operator <code>.</code>

In [ ]:
df

In [ ]:
df.name

In [ ]:
# Different ways to select a columns

# The "index" operator --> []
# The "dot" operator --> .

df['id']
df.id

# Both perform the same thing

In [ ]:
# Another example with the use of "sum()" method"

df.id.sum()
df['id'].sum()

# Both perform the same thing

In [ ]:
# Selecting multiple columns
# To select multiple columns, you can pass a list of column names to the indexing operator

df[['id','name']]

In [ ]:
df

In [ ]:
# When creating a subset we can also use
    # the "index" [] operator
        # or
    # "dot" . operator

df[ df.id>3  ]

df[  df['id']>3   ]

# Same thing- Both return rows where the values in column 'Var1' bigger than 3

In [ ]:
# Same thing- Both return rows where the values in column 'Var1' equal to 3
df[df.id==3]
df[df['id']==3]

In [ ]:
# Error
df[df.id=3]
df[df['id']=3]

# Have to use DOUBLE ==

In [ ]:
# Same thing- Both return rows where the values in column 'Var1' not equal to 3
df[df.id!=3]
df[df['id']!=3]

In [ ]:
df

In [ ]:
# 2 Conditions -- Notice that we've added Parenthesis ()
df[(df.id!=3) & (df.student==True)]
df[(df['id']!=3) & (df['student']==True)]
# & --> "and" operator

In [ ]:
# 2 Conditions -- Notice that we've added Parenthesis ()
df[(df.id!=3) | (df.student==True)]
df[(df['id']!=3) | (df['student']==True)]
# & --> "or" operator

In [ ]:
# 1 Condition and Specific columns --> we'll use "loc"
df.loc[df.id!=3,['id','student']]
df.loc[df['id']!=3,['id','student']]

In [ ]:
# 2 Conditions and Specific columns --> we'll use "loc"
df.loc[(df.id!=3) & (df.student==True) ,['id','student']]
df.loc[(df['id']!=3) & (df['student']==True),['id','student']]

<br>
<br>
<hr class="dotted">
<br>
<br>

## Series

<br>Series is a type of list in pandas which can take integer values, string values, double values and more....
<br>Series can only contain single list with index, whereas dataframe can be made of more than one series or we can say that a dataframe is a collection of series that can be used to analyse the data.

In [48]:
# Pandas Series
# Is like a column in a table
# Basicly it's like a data frame only that it has only one column
# It is a one-dimensional array holding data of any type

se = pd.Series([1,5,8,3])
se

0    1
1    5
2    8
3    3
dtype: int64

In [ ]:
# Return first value
se[0]

In [ ]:
# Return second value
se[1]

In [ ]:
# Return the 3 first value
se[0:3]

In [ ]:
# Return specific 2 values
se[[0,3]]

In [ ]:
# Create specific Indexes (like we did before)
se = pd.Series([1,5,8,3], index = ["a","b","c","d"])
se

In [ ]:
# choosing the value in the "b" index
se["b"]

In [ ]:
se = pd.Series({"a":1,"b":5,"c":8,"d":3})
se

In [ ]:
se.loc['a']

In [ ]:
se.loc['b']

In [ ]:
# Error
se.loc['b','c']

In [ ]:
# specific indexes
se.loc[['b','d']]

In [ ]:
# range indexes
se.loc['b':'d']

In [ ]:
# Error
se.iloc['a']

In [ ]:
se.iloc[1]

In [ ]:
se.iloc[2]

In [ ]:
# Error
se.iloc[1,3]

In [ ]:
# specific indexes
se.iloc[[1,3]]

In [ ]:
# range indexes
se.iloc[1:3]

In [ ]:
se.sum()

In [ ]:
se.mean()

In [ ]:
se.describe()

In [ ]:
se.head(2)

In [ ]:
se.to_numpy()

In [ ]:
se.dtype

In [ ]:
se.index

In [ ]:
se.values

In [ ]:
se.name
# there isn't any name

In [ ]:
se
# there isn't any name

In [ ]:
se.name = 'SomeName'

In [ ]:
se.name

In [ ]:
se

In [ ]:
se_index = pd.Series(se.index)
se_index

In [ ]:
# creating from 2 series a DF
# first creating the dic
d = {'se':list(se), 'se_index':list(se_index)}
d

In [ ]:
# creating from 2 series a DF
# Second creating the df
df_from_se = pd.DataFrame(d)
df_from_se

For conclusion: Series is like a column, a DataFrame is the whole table

<br>
<hr class="dotted">
<br>

## <code>pwd</code>

To get the current working directory of in a Python script use --> "pwd" (print working directory) -- Notice! has to run alone

In [ ]:
pwd

<br>
<hr class="dotted">
<br>